Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: In the widget using the ``rotary_sensitivity`` style property (1/256 unit)
it_it: Nel widget utilizzando la proprietà di stile ``rotary_sensitivity`` (1/256 di unità)

source: In these cases rendering (drawing) is handled internally and you don't see the :ref:`Drawing Pipeline <draw_pipeline>` at all.
it_it: In questi casi, il rendering (disegno) viene gestito internamente e non viene visualizzata la :ref:`Pipeline di Disegno <draw_pipeline>`.

source: In these events you can use :cpp:func:`lv_file_explorer_get_current_path` to get the current path and :cpp:func:`lv_file_explorer_get_selected_file_name` to get the name of the currently selected file in the event processing function.
it_it: In questi eventi è possibile utilizzare :cpp:func:`lv_file_explorer_get_current_path` per ottenere il path corrente e :cpp:func:`lv_file_explorer_get_selected_file_name` per ottenere il nome del file attualmente selezionato nella funzione di elaborazione degli eventi.

source: In this C file, the ``set`` functions for each API ``<prop>`` also need to be implemented.
it_it: In questo file C, è necessario implementare anche le funzioni ``set`` per ciascuna API ``<prop>``.

source: In this case LVGL will attempt to include ``lv_conf.h`` simply with ``#include "lv_conf.h"``.
it_it: In questo caso, LVGL tenterà di includere ``lv_conf.h`` semplicemente con ``#include "lv_conf.h"``.

source: In this case ``ext_click_area`` makes the sensitive area ticker both inward and outward.
it_it: In questo caso, ``ext_click_area`` fa sì che l'area sensibile si estenda sia verso l'interno che verso l'esterno.

source: In this case the options string's contents must remain available for the life of the Drop-Down List and :cpp:func:`lv_dropdown_add_option` cannot be used.
it_it: In questo caso, il contenuto della stringa delle opzioni deve rimanere disponibile per tutta la durata della Drop-Down List e :cpp:func:`lv_dropdown_add_option` non può essere utilizzato.

source: In this case you can just send a Pull Request without worrying about any licensing issues.
it_it: In questo caso si può semplicemente inviare una Pull Request senza preoccuparsi di problemi di licenza.

source: In this case, *y == 0* will be at the bottom of the Widget.
it_it: In questo caso, *y == 0* sarà in fondo al Widget.

source: In this case, PR, which is the default value of PKGR, helps the package manager distinguish which package is the most recent one in cases where many packages have the same PV (i.e. PKGV).
it_it: In questo caso, il PR, che è il valore di default di PKGR, aiuta il gestore di pacchetti a distinguere quale pacchetto sia il più recente nei casi in cui molti pacchetti abbiano lo stesso PV (ad esempio, PKGV).

source: In this case, an ``lv_slider`` will be created first, and the children will be added to it.
it_it: In questo caso, verrà creato prima un ``lv_slider`` e a esso verranno aggiunti i figli.

source: In this case, if the property is inheritable, the property's value will be searched up the parent hierarchy until a Widget specifies a value for the property.
it_it: In questo caso, se la proprietà è ereditabile, il valore della proprietà verrà ricercato nella gerarchia padre finché un Widget non ne specifica un valore.

source: In this case, in the ``read_cb``, set ``data->key`` to the pressed key.
it_it: In questo caso, in ``read_cb``, settare ``data->key`` sul tasto premuto.

source: In this case, it creates a build directory, It invokes CMake to configure the project, specifying build options and paths based on variables in your recipe.
it_it: In questo caso, crea una directory di build e richiama CMake per configurare il progetto, specificando le opzioni di build e i path in base alle variabili nella ricetta.

source: In this case, it is interesting to set some of the IDF project wide options on the `sdkconfig.defaults` such as:
it_it: In questo caso, è utile impostare alcune opzioni a livello di progetto IDF su `sdkconfig.defaults`, come ad esempio:

source: In this case, it must be deleted to terminate the Animation.
it_it: In questo caso, è necessario eliminarla per terminare l'Animazione.

source: In this case, just manually create new C and H files for a ``super_button`` with a function like:
it_it: In questo caso, basta creare manualmente nuovi file C e H per un ``super_button`` con una funzione come:

source: In this case, the Editor will generate the C array (:cpp:type:`lv_image_dsc_t`) and also generate code to register the images.
it_it: In questo caso, l'editor genererà l'array C (:cpp:type:`lv_image_dsc_t`) e genererà anche il codice per registrare le immagini.

source: In this case, the Widget will be sliced into ``LV_DRAW_SW_LAYER_SIMPLE_BUF_SIZE`` sized chunks.
it_it: In questo caso, il Widget verrà suddiviso in blocchi di dimensioni ``LV_DRAW_SW_LAYER_SIMPLE_BUF_SIZE``.

source: In this case, the caller is responsible for creating and destroying the draw buffer.
it_it: In questo caso, il chiamante è responsabile della creazione e della distruzione del buffer di disegno.

source: In this case, the image will be rendered as text according to the *font* specified in the style.
it_it: In questo caso, l'immagine verrà visualizzata come testo in base al *font* specificato nello stile.

source: In this case, the main ``while(1)`` could look like this:
it_it: In questo caso, il ``while(1)`` principale potrebbe apparire così:

source: In this case, the options should be separated by ``|``, for example: ``axis=primary_x|secondary_y``.
it_it: In questo caso, le opzioni devono essere separate da ``|``, per esempio: ``axis=primary_x|secondary_y``.

source: In this case, the text is not stored in dynamic memory and the given buffer is used directly instead.
it_it: In questo caso, il testo non viene posto nella memoria dinamica e viene utilizzato direttamente il buffer specificato.

source: In this case, the variable is specifying files for a package related to development (i.e., header files).
it_it: In questo caso, la variabile specifica i file per un pacchetto correlato allo sviluppo (ad esempio, file header).

source: In this case, the work directory the build system uses to build the package would be as follows:
it_it: In questo caso, la directory di lavoro utilizzata dal sistema di build per compilare il pacchetto sarebbe la seguente:

source: In this case, the work directory the build system uses to keep the unpacked recipe for db (Berkeley DB) is the following:
it_it: In questo caso, la directory di lavoro utilizzata dal sistema di build per conservare la ricetta decompressa per il db (Berkeley DB) è la seguente:

source: In this case, this combined state has 0x0020 + 0x0002 = 0x0022 precedence, which is higher than the pressed state's precedence so rose color would be used.
it_it: In questo caso, questo stato combinato ha una precedenza 0x0020 + 0x0002 = 0x0022, che è superiore alla precedenza dello stato pressed, quindi verrà utilizzato il colore rosa.

source: In this case, when the button is released (it's in default state) it will be red because a perfect match is found in the most recently added style (red).
it_it: In questo caso, quando il pulsante viene rilasciato (è nello stato di default), sarà rosso perché è stata trovata una corrispondenza perfetta nello stile aggiunto più di recente (rosso).

source: In this case, you could manually create a :cpp:type:`lv_image_dsc_t` and point the ``data`` field to the byte array containing the file content and set the ``header.cf`` field to :c:macro:`LV_COLOR_FORMAT_RAW` or :c:macro:`LV_COLOR_FORMAT_RAW_ALPHA`, and set the image source to this :cpp:type:`lv_image_dsc_t` object using :cpp:expr:`lv_image_set_src(icon, &my_img_dsc)`, and when it is time to decode, the registered decoder that recognizes the image format will be used to decode it.
it_it: In questo caso, è possibile creare manualmente un :cpp:type:`lv_image_dsc_t` e puntare il campo ``data`` all'array di byte contenente il contenuto del file, quindi impostare il campo ``header.cf`` su :c:macro:`LV_COLOR_FORMAT_RAW` o :c:macro:`LV_COLOR_FORMAT_RAW_ALPHA`, quindi impostare la sorgente dell'immagine su questo oggetto :cpp:type:`lv_image_dsc_t` utilizzando :cpp:expr:`lv_image_set_src(icon, &my_img_dsc)`. Al momento della decodifica, verrà utilizzato il decodificatore registrato che riconosce il formato dell'immagine.

source: In this context, a "variable" is a C symbol that is used in C code to refer to an object in either RAM or ROM.
it_it: In questo contesto, una "variabile" è un simbolo C utilizzato nel codice C per fare riferimento a un oggetto nella RAM o nella ROM.

source: In this context, images and labels are somewhat interchangeable: images can display text by using the macro :c:macro:`LV_SYMBOL_DUMMY` (which equates to a 3-byte C string containing a special code) as the prefix of the text.
it_it: In questo contesto, immagini ed etichette sono in qualche modo intercambiabili: le immagini possono visualizzare del testo utilizzando la macro :c:macro:`LV_SYMBOL_DUMMY` (che equivale a una stringa C di 3 byte contenente un codice speciale) come prefisso del testo.

source: In this event the created draw task can be modified or new draw tasks can be added.
it_it: In questo caso, il task di disegno creato può essere modificato o è possibile aggiungerne di nuovi.

source: In this example, the `my_rounder_cb` function rounds the coordinates of the redrawn area to the nearest multiple of 8.
it_it: In questo esempio, la funzione `my_rounder_cb` arrotonda le coordinate dell'area ridisegnata al multiplo di 8 più vicino.

source: In this guide, we are on the ``scarthgap`` branch, so we are using lvgl 9.1.0.
it_it: In questa guida, ci troviamo sul branch ``scarthgap``, quindi utilizziamo lvgl 9.1.0.

source: In this guide, we will use ``prj.conf`` for simplicity, but you may adapt the configuration approach to your project's needs.
it_it: In questa guida, per semplicità utilizzeremo ``prj.conf``, ma è possibile adattare l'approccio di configurazione alle esigenze del proprio progetto.

source: In this mode if a button is pressed only the button's area will be redrawn.
it_it: In questa modalità, se si preme un pulsante, verrà ridisegnata solo l'area del pulsante.

source: In this mode:
it_it: In questa modalità:

source: In this setup, the ``btn_text`` property is mandatory.
it_it: In questa configurazione, la proprietà ``btn_text`` è obbligatoria.

source: In this system all named colors have a nominal main color as well as four darker and five lighter variants.
it_it: In questo sistema, tutti i colori denominati hanno un colore principale nominale e quattro varianti più scure e cinque più chiare.

source: In this way, by the time the evaluation sequence is complete, the task will contain the score and the ID of the Drawing Unit that will be used to perform that task when it is :ref:`dispatched <draw task dispatching>`.
it_it: In questo modo, al termine della sequenza di valutazione, il task conterrà il punteggio e l'ID della Drawing Unit che verrà utilizzata per eseguire tale attività quando verrà :ref:`dispatched [inviata] <draw task dispatching>`.

source: In variable and function names use only lower case letters (e.g. *height_tmp*)
it_it: Nei nomi di variabili e di funzioni utilizzare solo lettere minuscole (ad esempio *height_tmp*)

source: In your ``frogfs`` clone directory make a copy of ``tools/transform-html-minifier.js`` called ``transform-xml-minifier.js`` and set the ``const options = { ... };`` to the below.
it_it: Nella directory clone ``frogfs``, creare una copia di ``tools/transform-html-minifier.js`` chiamata ``transform-xml-minifier.js`` e impostare ``const options = { ... };`` come segue.

source: In your ``main.cpp``, initialize LVGL and the display driver:
it_it: In ``main.cpp``, inizializzare LVGL e il driver video:

source: In your custom GPU :ref:`draw unit <draw units>`, call a custom post-processing function after ``lv_image_decoder_open`` to adjust the data in the image cache, and
it_it: Nella GPU custom :ref:`draw unit <draw units>`, chiama una funzione di post-elaborazione personalizzata dopo ``lv_image_decoder_open`` per regolare i dati nella cache delle immagini, poi

source: In your initialization code, create the display and set the buffers and flush callback.
it_it: Nel codice di inizializzazione, si crea il display e si impostano i buffer e la funzione di callback del flush.

source: In your initialization code, create the touch screen indev.
it_it: Nel codice di inizializzazione, crea l'indev [input device] del touchscreen.

source: In your terminal you should see CMSIS packs being installed.
it_it: Nel terminale si dovrebbero vedere i pacchetti CMSIS in fase di installazione.

source: In your timer handler loop, you should delay with ``HAL_Delay``.
it_it: Nel ciclo del gestore del timer, si deve ritardare ritardare con ``HAL_Delay``.

source: In-Line Code Expressions
it_it: Espressioni di Codice In-Line

source: Inactivity Measurement
it_it: Misurazione dell'Inattività

source: Include LVGL in Your Project
it_it: Includere LVGL nel Progetto

source: Include UEFI type definitions.
it_it: Includere le definizioni del tipo UEFI.

source: Include ``lv_global.h`` on files that use ``LV_GLOBAL_DEFAULT``
it_it: Includere ``lv_global.h`` nei file che usano ``LV_GLOBAL_DEFAULT``

source: Include a space after the ``/*`` or ``/**<`` and before the ``*/`` for improved readability.
it_it: Includere uno spazio dopo ``/*`` o ``/**<`` e prima di ``*/`` per migliorare la leggibilità.

source: Include at least 1 empty line after a code block.
it_it: Includere almeno 1 riga vuota dopo un blocco di codice.

source: Include paths
it_it: Path di inclusione

source: Includes
it_it: Include

source: Includes ``<widget_name>_gen.h`` and allows the user to define custom APIs.
it_it: Include ``<widget_name>_gen.h`` e consente all'utente di definire API personalizzate.

source: Increase the clock speed of the SPI or parallel port if you use them to drive the display.
it_it: Aumentare la velocità del clock della porta SPI o della parallela se si utilizzano per pilotare il display.

source: Increase the size of the display buffer.
it_it: Aumentare la dimensione del buffer di visualizzazione.

source: Increase the stack size of the task that calls :cpp:func:`lv_timer_handler`.
it_it: Aumentare la dimensione dello stack del task che chiama :cpp:func:`lv_timer_handler`.

source: Increase the value of :c:macro:`LV_PROFILER_BUILTIN_BUF_SIZE`.
it_it: Aumentare il valore di :c:macro:`LV_PROFILER_BUILTIN_BUF_SIZE`.

source: Increment
it_it: Incremento

source: Increment Subject Value
it_it: Incrementare il Valore di Subject

source: Incrementing or decrementing a :ref:`Subject <observer_subject>` value can be defined as follows:
it_it: L'incremento o il decremento di un valore :ref:`Subject <observer_subject>` può essere definito come segue:

source: Indent using 4 spaces (not tab characters).
it_it: Rientrare utilizzando 4 spazi (non caratteri di tabulazione).

source: Index of the first character for selection (character index, not byte index, since some characters can be multi-byte characters).
it_it: Indice del primo carattere da selezionare (indice del carattere, non indice del byte, poiché alcuni caratteri possono essere caratteri multibyte).

source: Index of the last character for selection.
it_it: Indice dell'ultimo carattere per la selezione.

source: Indexed colors
it_it: Colori indicizzati

source: Indexed with 16-color palette
it_it: Indicizzato con tavolozza a 16 colori

source: Indexed with 2-color palette
it_it: Indicizzato con tavolozza a 2 colori

source: Indexed with 256-color palette
it_it: Indicizzato con tavolozza a 256 colori

source: Indexed with 4-color palette
it_it: Indicizzato con tavolozza a 4 colori

source: Indicates ``text`` is constant and its pointer can be cached.
it_it: Indica che ``text`` è costante e il suo puntatore può essere memorizzato nella cache.

source: Indicates the original, non-clipped area where the image is drawn.
it_it: Indica l'area originale, non ritagliata, in cui viene disegnata l'immagine.

source: Indicator
it_it: Indicatore

source: Infinite scrolling
it_it: Scrolling infinito

source: Inheritance
it_it: Ereditarietà

source: Inheritance is applied only if the given property is not set in the Widget's styles (even in default state).
it_it: L'ereditarietà viene applicata solo se la proprietà specificata non è impostata negli stili del Widget (nemmeno nello stato di default).

source: Initialization
it_it: Inizializzazione

source: Initialization for Widgets
it_it: Inizializzazione per i Widget

source: Initialize Font Manager
it_it: Inizializzare Font Manager

source: Initialize LVGL itself.
it_it: Inizializzare LVGL stesso.

source: Initialize LVGL once early during system execution by calling :cpp:func:`lv_init`.
it_it: Inizializzare LVGL una sola volta all'inizio dell'esecuzione del sistema chiamando :cpp:func:`lv_init`.

source: Initialize VGLite GPU before calling :cpp:func:`lv_init` by specifying the width/height of tessellation window.
it_it: Inizializza la GPU VGLite prima di chiamare :cpp:func:`lv_init` specificando la larghezza/altezza della finestra di tassellatura.

source: Initialize and run LVGL
it_it: Inizializzare ed eseguire LVGL

source: Initialize the library.
it_it: Inizializzare la libreria.

source: Initialize the theme.
it_it: Inizializzare il Tema

source: Initialize your drivers.
it_it: Inizializzare i driver.

source: Initializing LVGL
it_it: Inizializzazione di LVGL

source: Initializing Styles
it_it: Inizializzazione degli Stili

source: Initializing styles
it_it: Inizializzazione degli stili

source: Initially the Widget is in the default state, so it's a simple case: the property is perfectly defined in the Widget's current state as white.
it_it: Inizialmente il Widget è nello stato di default, quindi è un caso semplice: la proprietà è perfettamente definita nello stato corrente del Widget, ovvero bianco.

source: Inner align
it_it: Allineamento interno

source: Input Device Emulation
it_it: Emulazione del Dispositivo di Input

source: Input Device Events
it_it: Eventi del Dispositivo di Input

source: Input device emulation
it_it: Emulazione del dispositivo di input

source: Input devices
it_it: Dispositivi di input

source: Input devices (lv_indev)
it_it: Dispositivi di input (lv_indev)

source: Input devices (or ``indev``) refer to all the modules and features related to user input handling.
it_it: I dispositivi di input (o ``indev``) si riferiscono a tutti i moduli e le funzionalità relative alla gestione dell'input utente.

source: Input devices are connected to a :ref:`Display <display>`, so make sure to create a display before creating indevs.
it_it: I dispositivi di input sono collegati a un :ref:`Display <display>`, quindi si deve creare un display prima di creare gli indev.

source: Input devices can also change the :ref:`State <widget_states>` of widgets.
it_it: I dispositivi di input possono anche modificare lo :ref:`Stato <widget_states>` dei widget.

source: Input devices can trigger a wide variety of events such as press, release, click, double or triple click, scroll, hover, and others.
it_it: I dispositivi di input possono attivare un'ampia varietà di eventi come pressione, rilascio, clic, doppio o triplo clic, scrolling, passaggio del mouse e altri.

source: Input devices that can click points on the display belong to the *Pointer* category.
it_it: I dispositivi di input che possono cliccare su punti sul display appartengono alla categoria *Puntatore*.

source: Input drivers:
it_it: Driver di input:

source: Input-Device Interface
it_it: Interfaccia al Device di Input

source: Insert the SD card into the laptop and check its mount point.
it_it: Inserire la scheda SD nel laptop e controllarne il punto di montaggio.

source: Inside ``<view>``, children can be added in a nested way using already defined ``widget``\s and ``component``\s.
it_it: All'interno di ``<view>``, è possibile aggiungere elementi figlio in modo nidificato utilizzando i ``widget`` e i ``component``.

source: Inside a ``<timeline>``, you add ``<animation>``\ s to describe each step.
it_it: All'interno di ``<timeline>``, si aggiungono le ``<animation>`` per descrivere ogni passaggio.

source: Inside most of ICOP's panel PCs is an x86 processor.
it_it: La maggior parte dei panel PC di ICOP è dotata di un processore x86.

source: Inspector mode to visualize widget sizes, paddings, etc.
it_it: Modalità Inspector per visualizzare le dimensioni dei widget, i padding, ecc.

source: Install
it_it: Installazione

source: Install Dependencies with CMake
it_it: Installare le Dipendenze con CMake

source: Install GLFW: ``sudo apt-get install libglfw3-dev``
it_it: Installare GLFW: ``sudo apt-get install libglfw3-dev``

source: Install J-Link Software (optional)
it_it: Installare il Software J-Link (facoltativo)

source: Install Podman
it_it: Installare Podman

source: Install Prerequisite tools
it_it: Installare gli strumenti Prerequisiti

source: Install Required VS Code Extensions
it_it: Installazione delle Estensioni di VS Code Richieste

source: Install SDL according to your platform:
it_it: Installa SDL in base alla piattaforma:

source: Install Visual Studio Code
it_it: Installazione Visual Studio Code

source: Install Visual Studio code.
it_it: Installare Visual Studio code.

source: Install WSL
it_it: Installare WSL

source: Install XLib development package: ``sudo apt-get install libx11-dev``
it_it: Installare il pacchetto di sviluppo XLib: ``sudo apt-get install libx11-dev``

source: Install XLib: ``sudo apt-get install libx11-6`` (should be installed already)
it_it: Installare XLib: ``sudo apt-get install libx11-6`` (dovrebbe essere già installato)

source: Install imagemagick, python3, python3-fontforge and potrace
it_it: Installare imagemagick, python3, python3-fontforge e potrace

source: Install the "Dev Containers" VS Code extension.
it_it: Installare l'estensione VS Code "Dev Containers".

source: Install the Alif SE Tools
it_it: Installare gli Alif SE Tool

source: Install the Editor
it_it: Installare l'Editor

source: Install the GStreamer development libraries for your platform as shown in the Dependencies section above.
it_it: Installare le librerie di sviluppo GStreamer per la propria piattaforma come mostrato nella precedente sezione "Dipendenze".

source: Install the LVGL Editor VS Code extension from within VS Code.
it_it: Installare l'estensione LVGL Editor VS Code da VS Code.

source: Install the Renesas VS Code extensions that you need.
it_it: Installare le estensioni Renesas VS Code necessarie.

source: Install the binary in the rootfs_overlay
it_it: Installare il binario in rootfs_overlay

source: Install the following VS Code extensions from the "Extensions" side panel
it_it: Installare le seguenti estensioni di VS Code dal pannello laterale "Extensions"

source: Install the prerequisites using ``scripts/install_prerequisites.sh/bat``.
it_it: Installare i prerequisiti usando ``scripts/install_prerequisites.sh/bat``.

source: Installation
it_it: Installazione

source: Installing FFmpeg
it_it: Installazione di FFmpeg

source: Installing |lvglpro| Editor on Linux is as simple as downloading the AppImage, making it executable (``chmod +x LVGL_Pro_Editor.AppImage``), and running it.
it_it: L'nstallazione dell'Editor |lvglpro| su Linux è semplice come scaricare l'AppImage, renderla eseguibile (``chmod +x LVGL_Pro_Editor.AppImage``) ed eseguirla.
